config.org
#+TITLE: Einstellungen Configuration
* package.el
:PROPERTIES:
:header-args:emacs-lisp: :tangle "packages.el" :comments link
:END:
Package loading
#+begin_src emacs-lisp :tangle "packages.el" :comments no
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
#+end_src
#+begin_src emacs-lisp
(package! aggressive-indent-mode)
(package! eval-in-repl)
(package! four-modifier :recipe (:host github :repo "sieman/four-modifier"))
(package! neo-layout-fly-keys :recipe (:host github :repo "sieman/neo-layout-fly-keys"))
(package! ox-confluence-en :recipe (:host github :repo "correl/ox-confluence-en"))
(package! ox-epub)
(package! ox-jira :recipe (:host github :repo "stig/ox-jira.el"))
(package! xah-fly-keys :recipe (:host github :repo "xahlee/xah-fly-keys"))
(package! ecb :recipe (:host github :repo "ecb-home/ecb"))
#+end_src

;; (package! rg) ; not using it at the moment
;; https://github.com/rougier/elegant-emacs (package! elegant-emacs :recipe (:host github :repo "rougier/elegant-emacs"))
;;(package! meow)                         ; is a modal keybinding system like xah-fly-keys and evil

* Appearance :appearance:

#224FBC Blauer Hintergrund wie Ocean

** Theme
#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
(custom-set-faces
 '(show-paren-match ((t (:background "black" :foreground "yellow" :inverse-video t :weight bold))))
 '(region ((t (:foreground "#f1c40f" :background "#2c3e50" :inverse-video t))))
 `(cursor ((t (:foreground "white" :background "red")))))
;; All themes are safe to load
(setq custom-safe-themes t)
;; Color the border of windows according to the `highlight' color of the doom's theme
(add-hook! 'doom-load-theme-hook
           ;; A more visible window border
           ;; (set-face-attribute 'vertical-border nil :foreground (doom-color 'highlight))
           ;; Flycheck errors use the color of functions
           (after! flycheck
             (set-face-attribute 'flycheck-error nil
                                 :underline `(:color ,(doom-color 'functions)
                                              :style wave))))
#+end_src
** Cursor
#+begin_src emacs-lisp
(custom-set-variables '(cursor-type 'box))
#+end_src

** Dashboard
#+begin_src emacs-lisp
;; Splash image
(setq fancy-splash-image (concat doom-private-dir "thenwhyworry.png")
      +doom-dashboard-banner-padding '(0 . 1))
;; Hide the menu for as minimalistic a startup screen as possible.
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
#+end_src
** Buffer
#+begin_src emacs-lisp
;; Main theme
;; (setq doom-theme 'doom-dracula)

(setq display-line-numbers-type nil)

;; (display-time-mode t)
(setq display-time-24hr-format t)
(setq display-line-numbers-type nil)

;;(load! "~/.emacs.secrets")
;;(setq fill-column  sim-hard-wrap-at)

;; Select and raise the frame, always
;;(select-frame-set-input-focus (selected-frame))
#+end_src
** Prety Symbol Mode Disable
https://github.com/hlissner/doom-emacs/issues/1807

#+begin_src emacs-lisp
                                        ;(setq +pretty-code-enabled-modes nil)
;; or
                                        ;(remove-hook 'after-change-major-mode-hook #'+pretty-code-init-pretty-symbols-h)
;; (setq! +ligatures-composition-alist nil)
#+end_src
** Which Key Mode
#+begin_src emacs-lisp
(after! which-key
  (setq which-key-side-window-max-width 0.44
        which-key-max-display-columns 2
        which-key-side-window-max-height 0.26
        which-key-max-description-length 90)
  (which-key-setup-side-window-right-bottom))
#+end_src
** Modeline
#+begin_src emacs-lisp
(after! doom-modeline
  (require 'doom-modeline)
  (setq doom-modeline-modal-icon nil)
  ;; https://github.com/hlissner/doom-emacs/issues/2967
  (setq all-the-icons-scale-factor 1.1) ;; orignal val 1.2

  (custom-set-faces!
    '(mode-line :family "Iosevka SS04" :height 0.96)
    '(mode-line-inactive :family "Iosevka SS04" :height 0.96))

  (message "doom-modeline is loaded. :-)"))
#+end_src
** Fonts
;; "JetBrains Mono"
;; "LFBONovelNetz" "LOB.Novellenschrift" "LOV.Novellenschrift" "LUC.NovellenschriftU1A"
;; "Iosevka" "Iosevka Fixed" "Iosevka Term" "Iosevka SS04"
;; "Source Code Variable"
;; "Overpass Nerd Font"
;; https://github.com/Lindydancer/font-lock-studio debugging font
;; https://tecosaur.github.io/emacs-config/config.html#font-face
#+begin_src emacs-lisp
;; (print (font-family-list))

(setq doom-font (font-spec :family "Iosevka SS04" :style "Thin" :size 13)
      ;; doom-variable-pitch-font (font-spec :family "LOV.Novellenschrift" :size 20)
      doom-big-font (font-spec :family "Iosevka SS04" :style "Bold" :size 20))

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))

(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

* Einstellungen Modus Anwendungen :settings:modes:
** Calendar
#+begin_src emacs-lisp
(load! "sim-calendar")
(require 'sim-calendar)
(set-language-environment "German")
(set-locale-environment "de_DE.UTF-8")
#+end_src
** Rechtschreibprüfung :spell:checking:

npm install dictionary-en-gb

#+begin_src emacs-lisp
(setq ispell-dictionary "de_DE")
(setq ispell-hunspell-dict-paths-alist
      '(
        ("de_DE" "~/Library/Spelling/de_DE.aff")
        ("en_GB" "~/Library/Spelling/en_GB.aff")
        ))
#+end_src
** Tastaturlayout :keyboard:layout:
#+begin_src emacs-lisp
(require 'four-modifier)
;;(load! "+neo-layout.el")
#+end_src
** TODO AI Auto Compleation
[[https://github.com/TommyX12/company-tabnine][Emacs Plugin]]
TabNine is the all-language autocompleter. It uses machine learning to provide responsive, reliable, and relevant suggestions.

** Multiple Cursors
#+begin_src emacs-lisp
(after! mc-mark-more
  (setq! mc/list-file "~/.e/sieman.doom.d/mc-lists.el")
  (setq! mc/match-cursor-style t)
  (define-key mc/keymap (kbd "<return>") nil)
  (message "mc-mark-more loaded")
  )
#+end_src
** Ivy is a generic completion mechanism for Emacs.
#+begin_src emacs-lisp
(after! ivy
  (ido-mode -1)
  ;; (global-unset-key (kbd "s-x"))
  ;; (general-define-key "s-x" 'kill-region)
  )
#+end_src
** Navigate Back and Forward, the Better Jump
Ich mag in einem Buffer herumspringen.
#+begin_src emacs-lisp
(after! better-jumper
  (setq! better-jumper-context 'buffer)
  (setq! better-jumper-use-savehist t)
  (setq! better-jumper-use-evil-jump-advice nil))
#+end_src

** Show Keys
Dies ist ein Minor-Mode und zeigt die gedrückten Tasten an.
#+begin_src emacs-lisp
(load! "+show-keys.el")
#+end_src

** dired - file manager
#+begin_src emacs-lisp
(after! dired
  (add-hook 'dired-mode-hook (lambda () (dired-hide-details-mode 1)))
  (put 'dired-find-alternate-file 'disabled nil))
#+end_src

** org-mode :org:
#+begin_src emacs-lisp
;; (with-eval-after-load 'org
;; (add-to-list 'sp-ignore-modes-list #'org-mode))
;; (with-eval-after-load 'org-agenda
;; (add-to-list 'sp-ignore-modes-list #'org-agenda-mode))

(after! org

  (add-to-list 'org-structure-template-alist '("se" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sc" . "src clojure"))
  (add-to-list 'org-structure-template-alist '("ss" . "src shell"))
  (add-to-list 'org-structure-template-alist '("sb" . "src fish :dir ~/ :results output"))
  (add-to-list 'org-structure-template-alist '("sf" . "src fish :mkdirp yes :tangle ~/.terminal-settings/config.fish"))

  (setq org-babel-clojure-backend 'cider
        org-hide-emphasis-markers t)
  )

(add-hook! 'org-log-buffer-setup-hook '(require 'org-keys))

#+end_src

*** Atlassian Export
This litle packages provide a export to jira and confluence  markup.

#+begin_src emacs-lisp :tangle packages.el
(package! ox-jira :recipe (:host github :repo "stig/ox-jira.el"))
(package! ox-confluence-en :recipe (:host github :repo "correl/ox-confluence-en"))
#+end_src
#+begin_src emacs-lisp
(use-package! ox-jira)
(use-package! ox-confluence-en)
#+end_src
*** *Org Face*
#+begin_src emacs-lisp
(add-hook! org-mode
           ;; Document title font
           (set-face-attribute 'org-document-title nil :height 2.0)
           (set-face-attribute 'org-level-1 nil :height 1.1)
           (set-face-attribute 'org-level-2 nil :height 1.1)
           (set-face-attribute 'org-level-3 nil :height 1.1)
           (set-face-attribute 'org-level-4 nil :height 1.1)
           (set-face-attribute 'org-level-5 nil :height 1.1)
           (set-face-attribute 'org-level-6 nil :height 1.1)
           (set-face-attribute 'org-level-7 nil :height 1.1)
           (set-face-attribute 'org-level-8 nil :height 1.1)
           (set-face-attribute 'org-block nil :height 1.1)
           ;; Face of keyword DONE (Green like strings)
           ;; (set-face-attribute 'org-done nil :foreground "#98be65")
           ;; Face of keyword TODO or [ ] (Purple like keywords)
           ;; (set-face-attribute 'org-todo nil :foreground "#c678dd")
           ;; Face of ellipsis symbol (Purple like keywords)
           (set-face-attribute 'org-ellipsis nil :foreground "#c678dd")
           ;; Face of the entire headline of a DONE line
           (set-face-attribute 'org-headline-done nil :foreground nil))
#+end_src
*Babel Support*
Ich möchte gerne Ergebnisse aus Clojures Code mit in org-Dateien einfügen.
[[https://www.orgmode.org/worg/org-contrib/babel/languages/ob-doc-clojure.html][Org-babel support for Clojure]]
** Deft for org-mode

#+begin_src emacs-lisp
(setq deft-extensions '("txt" "tex" "org"))
(setq deft-directory "~/Documents/orgs")
(setq deft-recursive t)
(global-set-key [f8] 'deft)
#+end_src

** Terminals

*** Ansi-Terminal

C-c C-j (term-line-mode) das Terminal verhält sich wie ein Text-Buffer.
C-c C-k (term-char-mode) das Terminal verhält fixirt den Cursor auf den Eingabe-Promt.

C-c C-q (term-pager-toggle)

C-c C-c (term-send-raw)
C-c C-x (term-send-raw)


https://echosa.github.io/blog/2012/06/06/improving-ansi-term/
Wenn man =exit= ins Terminal eingibt beendet sich das Terminal und der Buffer soll sich dabei auch schießen.

#+begin_src emacs-lisp
(defadvice term-sentinel (around my-advice-term-sentinel (proc msg))
  (if (memq (process-status proc) '(signal exit))
      (let ((buffer (process-buffer proc)))
        ad-do-it
        (kill-buffer buffer))
    ad-do-it))
(ad-activate 'term-sentinel)
#+end_src

Ich benutze die Z-Shell und ich möchte auch nicht mehr nach einer anderen Shell gefragt werden.

#+begin_src emacs-lisp
(defvar my-term-shell "/usr/local/bin/fish")
(setq shell-file-name "/usr/local/bin/fish")
(defadvice ansi-term (before force-bash)
  (interactive (list my-term-shell)))
(ad-activate 'ansi-term)
#+end_src

** Cider
*Evaluation:*
_in buffer:_
| =C-x C-e=           | cider-eval-last-sexp |
| =C-c C-e=           |                      |
| =<localleader> e e= |                      |
Evaluate the form preceding point and display the result in the echo area and/or
in an buffer overlay (according to cider-use-overlays). If invoked with a prefix
argument, insert the result into the current buffer.

| =<localleader> p D= | =cider-pprint-eval-defun-to-comment= |
Produces an output like this: =;;-> {"dark olive" 1, "vibrant plum" 2}=

_to REPL:_
| =C-c M-e=           | cider-eval-last-sexp-to-repl        |
| =<localleader> p r= | =cider-pprint-eval-last-sexp-to-repl= |
Evaluate the form preceding point and output it result to the REPL buffer. If
invoked with a prefix argument, takes you to the REPL buffer after being
invoked.

_from Source to REPL:_
| =C-return= | eir-eval-in-cider |
Copy the expression from buffer and paste it in REPL then evaluates it.

Navigation
Refactoring
Editing

Ich möchte gerne eine Historie für die REPL haben.

#+begin_src emacs-lisp
;; (after! cider
(set-popup-rule! "^\\*cider-clojuredocs\\*" :side 'right :size 0.5)
;; )
;; (after! cider-repl-mode
;;   (setq cider-repl-history-size 100000
;;         cider-repl-history-file "~/.organisation/snippedlab/clojure-repl-history"
;;         ))
;; (add-hook! 'cider-mode-hook
;; (setq cider-repl-history-size 10000
;;        cider-repl-history-file "~/.organisation/snippedlab/clojure-repl-history"
;; ))
#+end_src

#+begin_src emacs-lisp
(after! clojure-mode
  (add-hook 'clojure-mode-hook #'aggressive-indent-mode)
  (message "My Clojure config")

  (defun clerk-show ()
    (interactive)
    (save-buffer)
    (let
        ((filename
          (buffer-file-name)))
      (when filename
        (cider-interactive-eval
         (concat "(nextjournal.clerk/show! \"" filename "\")")))))

  (define-key clojure-mode-map (kbd "<M-return>") 'clerk-show)

  )
#+end_src

** Eval in the REPL
#+begin_src emacs-lisp :tangle "packages.el"
(package! eval-in-repl)
#+end_src
#+begin_src emacs-lisp
(after! cider
  (require 'eval-in-repl-cider)
  (define-key clojure-mode-map (kbd "<C-return>") 'eir-eval-in-cider))
#+end_src

** Fly Keys by Xah Lee
#+begin_src emacs-lisp :tangle packages.el
(package! xah-fly-keys :recipe (:host github :repo "xahlee/xah-fly-keys"))
(package! neo-layout-fly-keys :recipe (:host github :repo "sieman/neo-layout-fly-keys"))
#+end_src

#+begin_src emacs-lisp
(after! xah-fly-keys

  (defun sim/flykeys-indicate-command-mode () (interactive)
         (custom-set-faces
          `(cursor ((t (:background "#1ea4ff"))))
          )
         ;; (custom-set-variables '(cursor-type 'hollow))
         (xah-fly-save-buffer-if-file)
         )

  (defun sim/flykeys-indicate-insert-mode () (interactive)
         (custom-set-faces
          `(cursor ((t (:background "red"))))
          )
         (custom-set-variables '(cursor-type 'box))
         (better-jumper-set-jump))

  (add-hook! 'xah-fly-command-mode-activate-hook 'sim/flykeys-indicate-command-mode)
  (add-hook! 'xah-fly-insert-mode-activate-hook  'sim/flykeys-indicate-insert-mode)
  (add-hook! 'magit-mode-hook 'xah-fly-insert-mode-activate)
  (add-hook! 'dired-hook 'xah-fly-insert-mode-activate)
  (add-hook! 'color-rg-mode-hook 'xah-fly-insert-mode-activate)

  (global-set-key (kbd "<f19>") 'xah-fly-command-mode-activate)
  (global-set-key (kbd "ESC ESC") 'xah-fly-command-mode-activate))

(defun sim/flykeys-on ()
  (interactive)
  (neo2/flykeys-on)
  (define-key xah-fly-command-map (kbd "1") nil)
  (define-key xah-fly-command-map (kbd "1") 'delete-other-windows)

  (define-key xah-fly-command-map (kbd "2") nil)
  (define-key xah-fly-command-map (kbd "2") 'split-window-below-and-move-there-dammit)
  (define-key xah-fly-command-map (kbd "3") nil)
  (define-key xah-fly-command-map (kbd "3") 'split-window-right-and-move-there-dammit)
  (define-key xah-fly-command-map (kbd "4") nil)
  (define-key xah-fly-command-map (kbd "4") 'delete-window)

  (define-key xah-fly-command-map (kbd "5") nil)
  (define-key xah-fly-command-map (kbd "5") (kbd! "C-c l"))
  ;;(define-key xah-fly-command-map (kbd "TAB") xah-fly--tab-key-map)

  (define-key xah-fly-command-map (kbd "8") nil)
  (define-key xah-fly-command-map (kbd "8") 'xah-select-text-in-quote)
  (define-key xah-fly-command-map (kbd "9") nil)
  (define-key xah-fly-command-map (kbd "9") 'xah-extend-selection)
  (define-key xah-fly-command-map (kbd "q") nil)
  (define-key xah-fly-command-map (kbd "q") (kbd! "C-c a"))

  (define-key xah-fly-command-map (kbd "o") nil)
  (define-key xah-fly-command-map (kbd "o") (kbd! "C-c"))

  (define-key xah-fly-command-map (kbd "O") nil)
  (define-key xah-fly-command-map (kbd "O") (kbd! "C-x"))

  (define-key xah-fly-command-map (kbd "d") nil)
  (define-key xah-fly-command-map (kbd "d") 'xah-goto-matching-bracket)

  (define-key xah-fly-command-map (kbd ",") nil)
  (define-key xah-fly-command-map (kbd ",") 'open-line)

  ;; (define-key xah-fly-command-map (kbd ".") nil)
  ;; (define-key xah-fly-command-map (kbd ".") xah-fly-dot-keymap)

  (define-key xah-fly-command-map (kbd "j") nil)
  (define-key xah-fly-command-map (kbd "j") 'xah-next-window-or-frame)

  (define-key xah-fly-command-map (kbd "SPC") nil)
  (define-key xah-fly-command-map (kbd "SPC") 'xah-insert-space-before)

  )
#+End_src

